# Data Grouping using pandas

In [1]:
import pandas as pd

In [2]:
d = {'regiment':['Punjab','Punjab','Punjab','Punjab','Sindh','Sindh','Sindh','Sindh','KP','KP','KP','KP'],
     'company':['1st','1st','2nd','2nd','1st','1st','2nd','2nd','1st','1st','2nd','2nd'],
    'name':['Ali','Zain','Safdar','Hameed','Kamran','Imran','Irfan','Adnan','Zeeshan','Awais','Kazmi','Nauman'],
     'PreTestScore':[34,4,4,2,4,31,2,4,5,6,76,5],'PostTestScore':[25,45,56,67,25,34,45,56,67,67,56,98]}

In [3]:
d

{'PostTestScore': [25, 45, 56, 67, 25, 34, 45, 56, 67, 67, 56, 98],
 'PreTestScore': [34, 4, 4, 2, 4, 31, 2, 4, 5, 6, 76, 5],
 'company': ['1st',
  '1st',
  '2nd',
  '2nd',
  '1st',
  '1st',
  '2nd',
  '2nd',
  '1st',
  '1st',
  '2nd',
  '2nd'],
 'name': ['Ali',
  'Zain',
  'Safdar',
  'Hameed',
  'Kamran',
  'Imran',
  'Irfan',
  'Adnan',
  'Zeeshan',
  'Awais',
  'Kazmi',
  'Nauman'],
 'regiment': ['Punjab',
  'Punjab',
  'Punjab',
  'Punjab',
  'Sindh',
  'Sindh',
  'Sindh',
  'Sindh',
  'KP',
  'KP',
  'KP',
  'KP']}

In [4]:
army = pd.DataFrame(d,columns=d.keys())

In [5]:
army.head()

  regiment company    name  PreTestScore  PostTestScore
0   Punjab     1st     Ali            34             25
1   Punjab     1st    Zain             4             45
2   Punjab     2nd  Safdar             4             56
3   Punjab     2nd  Hameed             2             67
4    Sindh     1st  Kamran             4             25

In [6]:
army.head(12)

   regiment company     name  PreTestScore  PostTestScore
0    Punjab     1st      Ali            34             25
1    Punjab     1st     Zain             4             45
2    Punjab     2nd   Safdar             4             56
3    Punjab     2nd   Hameed             2             67
4     Sindh     1st   Kamran             4             25
5     Sindh     1st    Imran            31             34
6     Sindh     2nd    Irfan             2             45
7     Sindh     2nd    Adnan             4             56
8        KP     1st  Zeeshan             5             67
9        KP     1st    Awais             6             67
10       KP     2nd    Kazmi            76             56
11       KP     2nd   Nauman             5             98

In [7]:
army[army['regiment'] == 'Punjab'].groupby('regiment').mean()

          PreTestScore  PostTestScore
regiment
Punjab            11.0          48.25

In [11]:
army.groupby('regiment').mean()

          PreTestScore  PostTestScore
regiment
KP               23.00          72.00
Punjab           11.00          48.25
Sindh            10.25          40.00

In [12]:
army.groupby('company').describe()

        PostTestScore                                                        \
                count       mean        std   min    25%   50%    75%   max
company
1st               6.0  43.833333  19.395017  25.0  27.25  39.5  61.50  67.0
2nd               6.0  63.000000  18.504054  45.0  56.00  56.0  64.25  98.0

        PreTestScore
               count  mean        std  min   25%  50%    75%   max
company
1st              6.0  14.0  14.380542  4.0  4.25  5.5  24.75  34.0
2nd              6.0  15.5  29.663108  2.0  2.50  4.0   4.75  76.0

In [13]:
army.groupby(['regiment','company']).PreTestScore.mean()

regiment  company
KP        1st         5.5
          2nd        40.5
Punjab    1st        19.0
          2nd         3.0
Sindh     1st        17.5
          2nd         3.0
Name: PreTestScore, dtype: float64